Revit 2027 API
Document.CreationGUID Property
 A unique identifier generated when the Document was first created.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid CreationGUID { get; }
Public ReadOnly Property CreationGUID As Guid
	Get
public:
property Guid CreationGUID {
	Guid get ();
}
member CreationGUID : Guid with get
Property Value
Guid
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace